benchmarks/tutorial-based/v10/Allrun
#!/bin/sh

NX=$1
NY=$2
NZ=$3
NOC=$4

cd ${0%/*} || exit 1    # Run from this directory

echo "Mesh"
sed "s/NX/$NX/g;s/NY/$NY/g;s/NZ/$NZ/g" system/blockMeshDict-mesh.in > system/blockMeshDict
sed "s/NoC/$NOC/" system/decomposeParDict-mesh.in > system/decomposeParDict

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Copy motorbike surface from resources directory
cp $FOAM_TUTORIALS/resources/geometry/motorBike.obj.gz constant/geometry/
runApplication surfaceFeatures

runApplication blockMesh

runApplication decomposePar -copyZero
runParallel snappyHexMesh -overwrite
runApplication reconstructParMesh -constant
rm -rf processor*

runApplication renumberMesh -constant -overwrite
grep "Layer mesh" log.snappyHexMesh | awk '{print $4}'

# Setup

echo
echo Setup

rm -f log.*
rm -rf processor*

runApplication decomposePar
ls -d processor* | xargs -I {} rm -rf ./{}/0
ls -d processor* | xargs -I {} cp -r 0.org ./{}/0


runParallel patchSummary
runParallel potentialFoam

# Solve
echo
echo Solve
runParallel $(getApplication)


#------------------------------------------------------------------------------
